
# Задание 1

def calculating_rating_information(rating):
    '''
    Берет значение рейтинга и находит информацию о нем

    Args:
         rating (int): Рейтинг продукта.

    Returns:
        str: описание, эмодзи, рейтинг
    '''

    match product_rating:
        case 10 | 9:
            return "Отличный продукт!", "🎉" ,"Нужно обязательно попробовать!"
        case 8 | 7:
            return "Хороший продукт!", "💝" ,"Рекомендуется попробовать"
        case 6 | 5 | 4:
            return "Средний продукт", "😐" ,"Можно попробовать"
        case 3 | 2 | 1:
            return "Плохой продукт!", "🤢" ,"Не пробуйте!"
        case _:
            return "Ошибка!", "❌" ,"число находится вне диапазона рейтинга"

print(f"{"="*15} Система Рейтинг продуктов {"="*15}")

try:
    product_rating = int(input("Введите рейтинг продукта который вы хотите проверить (число от 1 до 10): "))

except ValueError:
    print("❌ Ошибка: введено некорректное значение!")

else:
    text_description, emoji, recommendation = calculating_rating_information(product_rating)

    print("="*57,"\n"*2)
    print(f"{"="*15}Рейтинг вашего продукта: {"="*15}")
    print(f"Ваш рейтинг {product_rating}⭐: {text_description} {emoji} {recommendation}")
    print("="*57)

# Задание 2

# print(f"{"="*15} Система статусов заказов {"="*15}")
#
# try:


# Задание 3



